#Дана строка Zadacha, проделайте математическое вычесление степени случайных чисел, по итогу используя их значение как павторение данной строки
text = "Zadacha"
a, b = 4, 5
c = (a ** b)
print(text * c)
